# Вывести на экран десять строк из нулей, 
# каждая строка пронумерована

for i in range (1,11):
   print(str(i)+ "." + "0"*i)