# Программа получает на вход число
# Выводит четное оно или нет


a=int(input("Введите число а ="))
if(a%2 == 0):
    print('Четное')
else:
    print('Нечетное')